var food = {
  "displayFieldName": "taddress",
  "fieldAliases": {
   "FID": "FID",
   "tid": "tid",
   "taddress": "taddress",
   "tkpa": "tkpa"
  },
  "geometryType": "esriGeometryPoint",
  "spatialReference": {
   "wkid": 2379,
   "latestWkid": 2379
  },
  "fields": [
    {
     "name": "FID",
     "type": "esriFieldTypeOID",
     "alias": "FID"
    },
    {
     "name": "tid",
     "type": "esriFieldTypeDouble",
     "alias": "tid"
    },
    {
     "name": "taddress",
     "type": "esriFieldTypeString",
     "alias": "taddress",
     "length": 254
    },
    {
     "name": "tkpa",
     "type": "esriFieldTypeDouble",
     "alias": "tkpa"
    }
   ],
   "features": [
    {
     "attributes": {
      "FID": 0,
      "tid": 18484,
      "taddress": "黄渡镇农民动迁房",
      "tkpa": 244.887
     },
     "geometry": {
      "x": -23428.240000000002,
      "y": 3843.8600000000001
     }
    },
    {
     "attributes": {
      "FID": 1,
      "tid": 18696,
      "taddress": "安礼景庭",
      "tkpa": 245.065
     },
     "geometry": {
      "x": -28311.299999999999,
      "y": 4056.7600000000002
     }
    },
    {
     "attributes": {
      "FID": 2,
      "tid": 181138,
      "taddress": "新黄路16号",
      "tkpa": 252.64599999999999
     },
     "geometry": {
      "x": -24146.080000000002,
      "y": 4197.71
     }
    },
    {
     "attributes": {
      "FID": 3,
      "tid": 18608,
      "taddress": "博园路6155弄",
      "tkpa": 237.154
     },
     "geometry": {
      "x": -26480.77,
      "y": 4233.54
     }
    },
    {
     "attributes": {
      "FID": 4,
      "tid": 18250,
      "taddress": "安亭新镇风苑",
      "tkpa": 249.673
     },
     "geometry": {
      "x": -28716.290000000001,
      "y": 4282.6000000000004
     }
    },
    {
     "attributes": {
      "FID": 5,
      "tid": 18751,
      "taddress": "安亭瑞仕华庭",
      "tkpa": 251.67500000000001
     },
     "geometry": {
      "x": -26807.560000000001,
      "y": 4628.5200000000004
     }
    },
    {
     "attributes": {
      "FID": 6,
      "tid": 18747,
      "taddress": "瑞士花园幼儿园",
      "tkpa": 212.488
     },
     "geometry": {
      "x": -26912.400000000001,
      "y": 4742.8800000000001
     }
    },
    {
     "attributes": {
      "FID": 7,
      "tid": 18375,
      "taddress": "绿苑新城",
      "tkpa": 244.881
     },
     "geometry": {
      "x": -24451.240000000002,
      "y": 4798.5699999999997
     }
    },
    {
     "attributes": {
      "FID": 8,
      "tid": 18752,
      "taddress": "嘉定区安研路66弄近博远路",
      "tkpa": 246.73099999999999
     },
     "geometry": {
      "x": -26510.299999999999,
      "y": 4920.2600000000002
     }
    },
    {
     "attributes": {
      "FID": 9,
      "tid": 18440,
      "taddress": "上城名都",
      "tkpa": 256.45999999999998
     },
     "geometry": {
      "x": -24921.349999999999,
      "y": 4971.0699999999997
     }
    },
    {
     "attributes": {
      "FID": 10,
      "tid": 18249,
      "taddress": "黄渡镇绿苑五村",
      "tkpa": 252.68199999999999
     },
     "geometry": {
      "x": -25101.060000000001,
      "y": 5044.5600000000004
     }
    },
    {
     "attributes": {
      "FID": 11,
      "tid": 18220,
      "taddress": "上海机动车测试中心",
      "tkpa": 243.416
     },
     "geometry": {
      "x": -27338.669999999998,
      "y": 5469.1999999999998
     }
    },
    {
     "attributes": {
      "FID": 12,
      "tid": 18646,
      "taddress": "新宏创宏房地产",
      "tkpa": 240.68799999999999
     },
     "geometry": {
      "x": -27776.799999999999,
      "y": 5750.1800000000003
     }
    },
    {
     "attributes": {
      "FID": 13,
      "tid": 18721,
      "taddress": "曹安公路4908弄",
      "tkpa": 252.89599999999999
     },
     "geometry": {
      "x": -25470.349999999999,
      "y": 5870.5699999999997
     }
    },
    {
     "attributes": {
      "FID": 14,
      "tid": 18464,
      "taddress": "上海瑞尔实业有限公司",
      "tkpa": 252.21199999999999
     },
     "geometry": {
      "x": -28158.860000000001,
      "y": 5914.5100000000002
     }
    },
    {
     "attributes": {
      "FID": 15,
      "tid": 18483,
      "taddress": "上海瑞尔实业有限公司",
      "tkpa": 260.75799999999998
     },
     "geometry": {
      "x": -28158.860000000001,
      "y": 5914.5100000000002
     }
    },
    {
     "attributes": {
      "FID": 16,
      "tid": 18631,
      "taddress": "墨玉南路1011弄",
      "tkpa": 200.15799999999999
     },
     "geometry": {
      "x": -29547.43,
      "y": 5968.29
     }
    },
    {
     "attributes": {
      "FID": 17,
      "tid": 18849,
      "taddress": "三德兴",
      "tkpa": 250.02699999999999
     },
     "geometry": {
      "x": -29174.369999999999,
      "y": 6076.1400000000003
     }
    },
    {
     "attributes": {
      "FID": 18,
      "tid": 18418,
      "taddress": "新源路155弄13号",
      "tkpa": 241.732
     },
     "geometry": {
      "x": -29870.98,
      "y": 6439.7600000000002
     }
    },
    {
     "attributes": {
      "FID": 19,
      "tid": 181017,
      "taddress": "于田路，昌吉东路",
      "tkpa": 248.184
     },
     "geometry": {
      "x": -26385.119999999999,
      "y": 6470.9799999999996
     }
    },
    {
     "attributes": {
      "FID": 20,
      "tid": 181017,
      "taddress": "于田路，昌吉东路",
      "tkpa": 248.184
     },
     "geometry": {
      "x": -26385.119999999999,
      "y": 6470.9799999999996
     }
    },
    {
     "attributes": {
      "FID": 21,
      "tid": 18514,
      "taddress": "泽普路588弄",
      "tkpa": 251.773
     },
     "geometry": {
      "x": -30211.43,
      "y": 6515.4499999999998
     }
    },
    {
     "attributes": {
      "FID": 22,
      "tid": 18659,
      "taddress": "米兰公寓",
      "tkpa": 240.761
     },
     "geometry": {
      "x": -26097.419999999998,
      "y": 6733.2600000000002
     }
    },
    {
     "attributes": {
      "FID": 23,
      "tid": 18513,
      "taddress": "昌吉路156号",
      "tkpa": 249.83199999999999
     },
     "geometry": {
      "x": -28801.700000000001,
      "y": 6917
     }
    },
    {
     "attributes": {
      "FID": 24,
      "tid": 18368,
      "taddress": "龙安佳苑",
      "tkpa": 241.768
     },
     "geometry": {
      "x": -28985.02,
      "y": 6935.46
     }
    },
    {
     "attributes": {
      "FID": 25,
      "tid": 18591,
      "taddress": "和静路1285号",
      "tkpa": 250.119
     },
     "geometry": {
      "x": -30007.049999999999,
      "y": 7477.4899999999998
     }
    },
    {
     "attributes": {
      "FID": 26,
      "tid": 18575,
      "taddress": "嘉定墨玉路和静路（宏立惠园）",
      "tkpa": 249.83199999999999
     },
     "geometry": {
      "x": -29435.580000000002,
      "y": 7502.7200000000003
     }
    },
    {
     "attributes": {
      "FID": 27,
      "tid": 18499,
      "taddress": "安亭文体中心",
      "tkpa": 251.773
     },
     "geometry": {
      "x": -29253.09,
      "y": 8049.1599999999999
     }
    },
    {
     "attributes": {
      "FID": 28,
      "tid": 18498,
      "taddress": "安亭文体中心",
      "tkpa": 252.69999999999999
     },
     "geometry": {
      "x": -29253.18,
      "y": 8051.71
     }
    },
    {
     "attributes": {
      "FID": 29,
      "tid": 18515,
      "taddress": "民丰路北震山路西",
      "tkpa": 251.529
     },
     "geometry": {
      "x": -29845.830000000002,
      "y": 8270.0200000000004
     }
    },
    {
     "attributes": {
      "FID": 30,
      "tid": 18905,
      "taddress": "新安汽车",
      "tkpa": 239.864
     },
     "geometry": {
      "x": -28616.099999999999,
      "y": 8305.9799999999996
     }
    },
    {
     "attributes": {
      "FID": 31,
      "tid": 18259,
      "taddress": "安亭镇福利院",
      "tkpa": 250.405
     },
     "geometry": {
      "x": -31542.220000000001,
      "y": 8457.4300000000003
     }
    },
    {
     "attributes": {
      "FID": 32,
      "tid": 181031,
      "taddress": "新源路1308号对面小区",
      "tkpa": 250.24700000000001
     },
     "geometry": {
      "x": -30610.700000000001,
      "y": 8573.1200000000008
     }
    },
    {
     "attributes": {
      "FID": 33,
      "tid": 18780,
      "taddress": "泰顺路475弄",
      "tkpa": 238.69200000000001
     },
     "geometry": {
      "x": -24680.57,
      "y": 8598.8899999999994
     }
    },
    {
     "attributes": {
      "FID": 34,
      "tid": 18912,
      "taddress": "上海伟德胶带有限公司",
      "tkpa": 259.78699999999998
     },
     "geometry": {
      "x": -25156.16,
      "y": 8672.5200000000004
     }
    },
    {
     "attributes": {
      "FID": 35,
      "tid": 18616,
      "taddress": "安亭百安公路",
      "tkpa": 248.54400000000001
     },
     "geometry": {
      "x": -25494.48,
      "y": 8706.2600000000002
     }
    },
    {
     "attributes": {
      "FID": 36,
      "tid": 18460,
      "taddress": "福色轩大酒店",
      "tkpa": 257.584
     },
     "geometry": {
      "x": -23152.939999999999,
      "y": 9297.5100000000002
     }
    },
    {
     "attributes": {
      "FID": 37,
      "tid": 18597,
      "taddress": "马陆康丰路28弄",
      "tkpa": 244.11199999999999
     },
     "geometry": {
      "x": -18623.59,
      "y": 9507.4699999999993
     }
    },
    {
     "attributes": {
      "FID": 38,
      "tid": 181149,
      "taddress": "彤闻路77弄199弄1-18楼",
      "tkpa": 260.92200000000003
     },
     "geometry": {
      "x": -29266.080000000002,
      "y": 9585.1599999999999
     }
    },
    {
     "attributes": {
      "FID": 39,
      "tid": 18926,
      "taddress": "玲珑坊",
      "tkpa": 244.07599999999999
     },
     "geometry": {
      "x": -18858.150000000001,
      "y": 9598.9099999999999
     }
    },
    {
     "attributes": {
      "FID": 40,
      "tid": 18686,
      "taddress": "墨玉北路685弄",
      "tkpa": 252.44399999999999
     },
     "geometry": {
      "x": -28767.41,
      "y": 9831.8199999999997
     }
    },
    {
     "attributes": {
      "FID": 41,
      "tid": 181030,
      "taddress": "前炬路366号",
      "tkpa": 260.80599999999998
     },
     "geometry": {
      "x": -29765.259999999998,
      "y": 9840.5599999999995
     }
    },
    {
     "attributes": {
      "FID": 42,
      "tid": 18785,
      "taddress": "嘉定区墨玉北路、前炬路口",
      "tkpa": 260.70299999999997
     },
     "geometry": {
      "x": -29440.27,
      "y": 9957.8500000000004
     }
    },
    {
     "attributes": {
      "FID": 43,
      "tid": 18757,
      "taddress": "颐景家园",
      "tkpa": 244.405
     },
     "geometry": {
      "x": -20289.639999999999,
      "y": 10270.57
     }
    },
    {
     "attributes": {
      "FID": 44,
      "tid": 18761,
      "taddress": "东环路651弄",
      "tkpa": 252.95699999999999
     },
     "geometry": {
      "x": -24095,
      "y": 10295.82
     }
    },
    {
     "attributes": {
      "FID": 45,
      "tid": 18688,
      "taddress": "兰园别墅",
      "tkpa": 266.83100000000002
     },
     "geometry": {
      "x": -28384.25,
      "y": 10349.790000000001
     }
    },
    {
     "attributes": {
      "FID": 46,
      "tid": 18497,
      "taddress": "上海佰顿新材料有限公司",
      "tkpa": 261.197
     },
     "geometry": {
      "x": -28274.849999999999,
      "y": 10366.799999999999
     }
    },
    {
     "attributes": {
      "FID": 47,
      "tid": 18911,
      "taddress": "上海绿地源泰置业有限公司",
      "tkpa": 244.46000000000001
     },
     "geometry": {
      "x": -20467.700000000001,
      "y": 10424.030000000001
     }
    },
    {
     "attributes": {
      "FID": 48,
      "tid": 18679,
      "taddress": "墨玉北路899弄",
      "tkpa": 249.78899999999999
     },
     "geometry": {
      "x": -28913.310000000001,
      "y": 10462.1
     }
    },
    {
     "attributes": {
      "FID": 49,
      "tid": 18444,
      "taddress": "美诺精密压铸(上海)有限公司",
      "tkpa": 259.92700000000002
     },
     "geometry": {
      "x": -27911.560000000001,
      "y": 10655.219999999999
     }
    },
    {
     "attributes": {
      "FID": 50,
      "tid": 18581,
      "taddress": "云屏路388弄",
      "tkpa": 243.72800000000001
     },
     "geometry": {
      "x": -20849.52,
      "y": 10727.57
     }
    },
    {
     "attributes": {
      "FID": 51,
      "tid": 18660,
      "taddress": "双单路889、999弄",
      "tkpa": 230.06700000000001
     },
     "geometry": {
      "x": -20066.330000000002,
      "y": 10738.700000000001
     }
    },
    {
     "attributes": {
      "FID": 52,
      "tid": 18632,
      "taddress": "保利湖畔阳光苑",
      "tkpa": 211.13300000000001
     },
     "geometry": {
      "x": -18488.209999999999,
      "y": 10785.290000000001
     }
    },
    {
     "attributes": {
      "FID": 53,
      "tid": 181071,
      "taddress": "宝安公路3386号",
      "tkpa": 244.78999999999999
     },
     "geometry": {
      "x": -18424.529999999999,
      "y": 10791.5
     }
    },
    {
     "attributes": {
      "FID": 54,
      "tid": 181070,
      "taddress": "宝安公路3386号",
      "tkpa": 244.09399999999999
     },
     "geometry": {
      "x": -18431.09,
      "y": 10791.84
     }
    },
    {
     "attributes": {
      "FID": 55,
      "tid": 18512,
      "taddress": "嘉定新城德立路99弄",
      "tkpa": 246.20599999999999
     },
     "geometry": {
      "x": -18301.98,
      "y": 10939.75
     }
    },
    {
     "attributes": {
      "FID": 56,
      "tid": 18929,
      "taddress": "嘉定区封周路508弄",
      "tkpa": 243.71600000000001
     },
     "geometry": {
      "x": -19128.799999999999,
      "y": 10944.09
     }
    },
    {
     "attributes": {
      "FID": 57,
      "tid": 18231,
      "taddress": "F1能源中心",
      "tkpa": 252.20599999999999
     },
     "geometry": {
      "x": -23134.290000000001,
      "y": 11170.15
     }
    },
    {
     "attributes": {
      "FID": 58,
      "tid": 18532,
      "taddress": "裕民南路336弄",
      "tkpa": 243.76400000000001
     },
     "geometry": {
      "x": -18620.389999999999,
      "y": 11171.48
     }
    },
    {
     "attributes": {
      "FID": 59,
      "tid": 181073,
      "taddress": "马陆镇城市规划建设管理办公室",
      "tkpa": 244.69200000000001
     },
     "geometry": {
      "x": -18380.43,
      "y": 11309.1
     }
    },
    {
     "attributes": {
      "FID": 60,
      "tid": 18700,
      "taddress": "龙湖郦城",
      "tkpa": 238.67400000000001
     },
     "geometry": {
      "x": -20444.720000000001,
      "y": 11336.93
     }
    },
    {
     "attributes": {
      "FID": 61,
      "tid": 18703,
      "taddress": "瑞金医院",
      "tkpa": 239.333
     },
     "geometry": {
      "x": -20333.34,
      "y": 11405.68
     }
    },
    {
     "attributes": {
      "FID": 62,
      "tid": 18705,
      "taddress": "瑞金医院",
      "tkpa": 228.108
     },
     "geometry": {
      "x": -20310.290000000001,
      "y": 11417.5
     }
    },
    {
     "attributes": {
      "FID": 63,
      "tid": 18733,
      "taddress": "希望路978弄",
      "tkpa": 206.53700000000001
     },
     "geometry": {
      "x": -20527.110000000001,
      "y": 11495.200000000001
     }
    },
    {
     "attributes": {
      "FID": 64,
      "tid": 18454,
      "taddress": "嘉定新城规划展示馆",
      "tkpa": 246.88999999999999
     },
     "geometry": {
      "x": -20261.57,
      "y": 11811.57
     }
    },
    {
     "attributes": {
      "FID": 65,
      "tid": 18526,
      "taddress": "云屏路1188弄",
      "tkpa": 236.87899999999999
     },
     "geometry": {
      "x": -21416.830000000002,
      "y": 11909.629999999999
     }
    },
    {
     "attributes": {
      "FID": 66,
      "tid": 18750,
      "taddress": "益力多乳品",
      "tkpa": 234.499
     },
     "geometry": {
      "x": -20509.509999999998,
      "y": 12038.780000000001
     }
    },
    {
     "attributes": {
      "FID": 67,
      "tid": 18766,
      "taddress": "云谷路1388弄",
      "tkpa": 231.75200000000001
     },
     "geometry": {
      "x": -21900.959999999999,
      "y": 12299.790000000001
     }
    },
    {
     "attributes": {
      "FID": 68,
      "tid": 18941,
      "taddress": "云屏路1286弄",
      "tkpa": 244.49100000000001
     },
     "geometry": {
      "x": -21693.970000000001,
      "y": 12357.02
     }
    },
    {
     "attributes": {
      "FID": 69,
      "tid": 18615,
      "taddress": "临泽路189弄",
      "tkpa": 234.279
     },
     "geometry": {
      "x": -22220.82,
      "y": 12420.870000000001
     }
    },
    {
     "attributes": {
      "FID": 70,
      "tid": 181125,
      "taddress": "白银路，云屏路",
      "tkpa": 243.10499999999999
     },
     "geometry": {
      "x": -21675.299999999999,
      "y": 12556.780000000001
     }
    },
    {
     "attributes": {
      "FID": 71,
      "tid": 18776,
      "taddress": "旭辉华庭",
      "tkpa": 244.167
     },
     "geometry": {
      "x": -21560.779999999999,
      "y": 12578.17
     }
    },
    {
     "attributes": {
      "FID": 72,
      "tid": 18534,
      "taddress": "宝塔路99弄",
      "tkpa": 224.42699999999999
     },
     "geometry": {
      "x": -19593.939999999999,
      "y": 12575.35
     }
    },
    {
     "attributes": {
      "FID": 73,
      "tid": 18486,
      "taddress": "嘉定新城东云街",
      "tkpa": 246.40100000000001
     },
     "geometry": {
      "x": -20341.25,
      "y": 12589.950000000001
     }
    },
    {
     "attributes": {
      "FID": 74,
      "tid": 18562,
      "taddress": "惠民家园",
      "tkpa": 228.87700000000001
     },
     "geometry": {
      "x": -21884.279999999999,
      "y": 12869.879999999999
     }
    },
    {
     "attributes": {
      "FID": 75,
      "tid": 18690,
      "taddress": "外钱路801弄",
      "tkpa": 248.452
     },
     "geometry": {
      "x": -30454.419999999998,
      "y": 12895.610000000001
     }
    },
    {
     "attributes": {
      "FID": 76,
      "tid": 18636,
      "taddress": "嘉定新城东云街",
      "tkpa": 244.66200000000001
     },
     "geometry": {
      "x": -20221.09,
      "y": 13079.57
     }
    },
    {
     "attributes": {
      "FID": 77,
      "tid": 18809,
      "taddress": "上海保利茂佳房地产",
      "tkpa": 246.19999999999999
     },
     "geometry": {
      "x": -20601.66,
      "y": 13194.620000000001
     }
    },
    {
     "attributes": {
      "FID": 78,
      "tid": 18840,
      "taddress": "上海顺驰方城有限公司",
      "tkpa": 258.68799999999999
     },
     "geometry": {
      "x": -28262.82,
      "y": 13336.799999999999
     }
    },
    {
     "attributes": {
      "FID": 79,
      "tid": 18436,
      "taddress": "保利家园一期",
      "tkpa": 247.32900000000001
     },
     "geometry": {
      "x": -20503.830000000002,
      "y": 13547.34
     }
    },
    {
     "attributes": {
      "FID": 80,
      "tid": 18602,
      "taddress": "洪德路55弄",
      "tkpa": 243.636
     },
     "geometry": {
      "x": -19915.889999999999,
      "y": 13921.98
     }
    },
    {
     "attributes": {
      "FID": 81,
      "tid": 18689,
      "taddress": "祁昌路135弄",
      "tkpa": 251.19900000000001
     },
     "geometry": {
      "x": -28408.360000000001,
      "y": 14129.290000000001
     }
    },
    {
     "attributes": {
      "FID": 82,
      "tid": 18640,
      "taddress": "外青松公路85号",
      "tkpa": 233.94900000000001
     },
     "geometry": {
      "x": -28085.529999999999,
      "y": 14137.74
     }
    },
    {
     "attributes": {
      "FID": 83,
      "tid": 18755,
      "taddress": "瞿门路399弄",
      "tkpa": 258.072
     },
     "geometry": {
      "x": -28980.080000000002,
      "y": 14263.34
     }
    },
    {
     "attributes": {
      "FID": 84,
      "tid": 18279,
      "taddress": "外岗新苑（二期）",
      "tkpa": 258.96300000000002
     },
     "geometry": {
      "x": -29187.310000000001,
      "y": 14397.290000000001
     }
    },
    {
     "attributes": {
      "FID": 85,
      "tid": 181105,
      "taddress": "恒飞路733弄",
      "tkpa": 256.72899999999998
     },
     "geometry": {
      "x": -29766.75,
      "y": 14448.25
     }
    },
    {
     "attributes": {
      "FID": 86,
      "tid": 18278,
      "taddress": "外岗新苑（一期）",
      "tkpa": 258.54199999999997
     },
     "geometry": {
      "x": -29367.669999999998,
      "y": 14713.57
     }
    },
    {
     "attributes": {
      "FID": 87,
      "tid": 18901,
      "taddress": "安泰金属表面处理",
      "tkpa": 257.24200000000002
     },
     "geometry": {
      "x": -29165.720000000001,
      "y": 15015.48
     }
    },
    {
     "attributes": {
      "FID": 88,
      "tid": 18988,
      "taddress": "牧谣食品",
      "tkpa": 258.36500000000001
     },
     "geometry": {
      "x": -29418.73,
      "y": 15272.309999999999
     }
    },
    {
     "attributes": {
      "FID": 89,
      "tid": 18808,
      "taddress": "上海嘉定新菊房地产",
      "tkpa": 244.149
     },
     "geometry": {
      "x": -23191.580000000002,
      "y": 15563.719999999999
     }
    },
    {
     "attributes": {
      "FID": 90,
      "tid": 18566,
      "taddress": "练祁佳苑",
      "tkpa": 235.249
     },
     "geometry": {
      "x": -23493.84,
      "y": 15931.059999999999
     }
    },
    {
     "attributes": {
      "FID": 91,
      "tid": 18574,
      "taddress": "新城悠活城一期",
      "tkpa": 227.833
     },
     "geometry": {
      "x": -22984.549999999999,
      "y": 16061.110000000001
     }
    },
    {
     "attributes": {
      "FID": 92,
      "tid": 181000,
      "taddress": "天信织带",
      "tkpa": 257.63200000000001
     },
     "geometry": {
      "x": -29872.91,
      "y": 16203.5
     }
    },
    {
     "attributes": {
      "FID": 93,
      "tid": 18825,
      "taddress": "上海泓誉房地产有限公司",
      "tkpa": 243.636
     },
     "geometry": {
      "x": -23814.439999999999,
      "y": 16212.51
     }
    },
    {
     "attributes": {
      "FID": 94,
      "tid": 18687,
      "taddress": "汇丰凯苑",
      "tkpa": 239.03999999999999
     },
     "geometry": {
      "x": -23674.84,
      "y": 16283.27
     }
    },
    {
     "attributes": {
      "FID": 95,
      "tid": 18969,
      "taddress": "上海同盛城北置业有限公司",
      "tkpa": 242.84299999999999
     },
     "geometry": {
      "x": -24500.119999999999,
      "y": 16320.08
     }
    },
    {
     "attributes": {
      "FID": 96,
      "tid": 18924,
      "taddress": "上海达昌装饰材料有限公司",
      "tkpa": 258.10199999999998
     },
     "geometry": {
      "x": -29926.830000000002,
      "y": 16510.900000000001
     }
    },
    {
     "attributes": {
      "FID": 97,
      "tid": 18708,
      "taddress": "上海万之城房地产开发有限公司",
      "tkpa": 230.28700000000001
     },
     "geometry": {
      "x": -23949.080000000002,
      "y": 16530.700000000001
     }
    },
    {
     "attributes": {
      "FID": 98,
      "tid": 18989,
      "taddress": "上海莱建置业有限公司",
      "tkpa": 244.30199999999999
     },
     "geometry": {
      "x": -24294.099999999999,
      "y": 16562.419999999998
     }
    },
    {
     "attributes": {
      "FID": 99,
      "tid": 18850,
      "taddress": "上海盛投置业",
      "tkpa": 244.11199999999999
     },
     "geometry": {
      "x": -24423.240000000002,
      "y": 16698.98
     }
    },
    {
     "attributes": {
      "FID": 100,
      "tid": 18706,
      "taddress": "玲珑湾",
      "tkpa": 244.22200000000001
     },
     "geometry": {
      "x": -25096.68,
      "y": 18699.549999999999
     }
    },
    {
     "attributes": {
      "FID": 101,
      "tid": 18338,
      "taddress": "海伦小区",
      "tkpa": 231.697
     },
     "geometry": {
      "x": -26503.200000000001,
      "y": 18855.889999999999
     }
    },
    {
     "attributes": {
      "FID": 102,
      "tid": 18913,
      "taddress": "鸿宝照明",
      "tkpa": 243.75800000000001
     },
     "geometry": {
      "x": -24725.52,
      "y": 19060.580000000002
     }
    },
    {
     "attributes": {
      "FID": 103,
      "tid": 18431,
      "taddress": "美龙大酒店",
      "tkpa": 245.815
     },
     "geometry": {
      "x": -26160.470000000001,
      "y": 19583.049999999999
     }
    },
    {
     "attributes": {
      "FID": 104,
      "tid": 18474,
      "taddress": "萨帕铝热有限公司",
      "tkpa": 225.697
     },
     "geometry": {
      "x": -24287.950000000001,
      "y": 20523.360000000001
     }
    },
    {
     "attributes": {
      "FID": 105,
      "tid": 18614,
      "taddress": "卡耐新能源",
      "tkpa": 240.542
     },
     "geometry": {
      "x": -25725.549999999999,
      "y": 21207.77
     }
    },
    {
     "attributes": {
      "FID": 106,
      "tid": 18335,
      "taddress": "上海洛克斯霓虹电子有限公司",
      "tkpa": 212.79900000000001
     },
     "geometry": {
      "x": -25814,
      "y": 21468.880000000001
     }
    },
    {
     "attributes": {
      "FID": 107,
      "tid": 18429,
      "taddress": "韩金包装材料有限公司",
      "tkpa": 246.059
     },
     "geometry": {
      "x": -25602.310000000001,
      "y": 21647.66
     }
    },
    {
     "attributes": {
      "FID": 108,
      "tid": 18914,
      "taddress": "文辉食品",
      "tkpa": 243.30699999999999
     },
     "geometry": {
      "x": -26986,
      "y": 22430.240000000002
     }
    },
    {
     "attributes": {
      "FID": 109,
      "tid": 181011,
      "taddress": "顶味食品",
      "tkpa": 244.00899999999999
     },
     "geometry": {
      "x": -26218.68,
      "y": 23364.77
     }
    },
    {
     "attributes": {
      "FID": 110,
      "tid": 18925,
      "taddress": "上海汇丰树脂厂",
      "tkpa": 243.56899999999999
     },
     "geometry": {
      "x": -28702.689999999999,
      "y": 23377.119999999999
     }
    }
   ]
  }